; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-7-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p1-3 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p4-0 - location
	p4-1 - location
	p4-5 - location
	p5-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s5)
	(at driver3 s3)
	(at driver4 s2)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s5)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s4)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s3)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at package1 s3)
	(at package2 s3)
	(at package3 s3)
	(at package4 s2)
	(at package5 s5)
	(at package6 s5)
	(at package7 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 68)
	(= (time-to-drive s1 s0) 68)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 62)
	(= (time-to-drive s2 s0) 62)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 71)
	(= (time-to-drive s4 s0) 71)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 5)
	(= (time-to-drive s5 s0) 5)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 28)
	(= (time-to-drive s5 s1) 28)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 68)
	(= (time-to-drive s1 s2) 68)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 48)
	(= (time-to-drive s3 s2) 48)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 90)
	(= (time-to-drive s1 s3) 90)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 27)
	(= (time-to-drive s1 s4) 27)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 26)
	(= (time-to-drive s2 s4) 26)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 59)
	(= (time-to-drive s3 s4) 59)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 53)
	(= (time-to-drive s2 s5) 53)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 53)
	(= (time-to-drive s4 s5) 53)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s3)
	(at driver3 s1)
	(at driver4 s5)
	(at truck1 s5)
	(at truck3 s5)
	(at truck4 s0)
	(at package1 s5)
	(at package4 s2)
	(at package5 s2)
	(at package6 s2)
	(at package7 s4)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver3 s3 p1-3)
   deleted: (at driver3 s3)
   added: (at driver3 p1-3)
   goals met: 1 of 11
2. (board-truck driver4 truck1 s2)
   deleted: (at driver4 s2) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 11
3. (walk driver2 s5 p5-3)
   deleted: (at driver2 s5)
   added: (at driver2 p5-3)
   goals met: 1 of 11
4. (walk driver2 p5-3 s3)
   deleted: (at driver2 p5-3)
   added: (at driver2 s3)
   goals met: 2 of 11
5. (walk driver3 p1-3 s1)
   deleted: (at driver3 p1-3)
   added: (at driver3 s1)
   goals met: 3 of 11
6. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 2 of 11
7. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 2 of 11
8. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 11
9. (drive-truck truck3 s0 s5 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 0 to 50
   goals met: 3 of 11
10. (load-truck package5 truck3 s5)
   deleted: (at package5 s5)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 3 of 11
11. (load-truck package6 truck3 s5)
   deleted: (at package6 s5)
   added: (in package6 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 3 of 11
12. (drive-truck truck3 s5 s2 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 50 to 739
   goals met: 2 of 11
13. (unload-truck package5 truck3 s2)
   deleted: (in package5 truck3)
   added: (at package5 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 3 of 11
14. (drive-truck truck1 s2 s4 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 739 to 999
   goals met: 3 of 11
15. (unload-truck package6 truck3 s2)
   deleted: (in package6 truck3)
   added: (at package6 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 4 of 11
16. (drive-truck truck1 s4 s3 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 999 to 1589
   goals met: 4 of 11
17. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 4 of 11
18. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 11
19. (drive-truck truck1 s3 s4 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 1589 to 2356
   goals met: 4 of 11
20. (unload-truck package7 truck1 s4)
   deleted: (in package7 truck1)
   added: (at package7 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 5 of 11
21. (drive-truck truck1 s4 s5 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (fuel-used) from 2356 to 2939
   goals met: 6 of 11
22. (unload-truck package1 truck1 s5)
   deleted: (in package1 truck1)
   added: (at package1 s5)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 11
23. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 2939 to 3619
   goals met: 7 of 11
24. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 6 of 11
25. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 6 of 11
26. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 6 of 11
27. (drive-truck truck3 s1 s5 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 3619 to 3899
   goals met: 7 of 11
28. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 3899 to 4519
   goals met: 8 of 11
29. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 8 of 11
30. (disembark-truck driver4 truck1 s5)
   deleted: (driving driver4 truck1)
   added: (at driver4 s5) (empty truck1)
   goals met: 9 of 11
31. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 9 of 11
32. (walk driver2 s0 p0-1)
   deleted: (at driver2 s0)
   added: (at driver2 p0-1)
   goals met: 9 of 11
33. (walk driver2 p0-1 s1)
   deleted: (at driver2 p0-1)
   added: (at driver2 s1)
   goals met: 9 of 11
34. (board-truck driver3 truck2 s5)
   deleted: (at driver3 s5) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 9 of 11
35. (walk driver2 s1 p1-3)
   deleted: (at driver2 s1)
   added: (at driver2 p1-3)
   goals met: 9 of 11
36. (walk driver2 p1-3 s3)
   deleted: (at driver2 p1-3)
   added: (at driver2 s3)
   goals met: 10 of 11
37. (drive-truck truck2 s5 s1 driver3)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 4519 to 4799
   goals met: 10 of 11
38. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 11 of 11
